Revit 2024 API
UnitTypeId.UsGallons Property
 US gallons.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId UsGallons { get; }
Visual Basic
Public Shared ReadOnly Property UsGallons As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ UsGallons {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace